content/books/software_engineering_at_google.md
+++
title = "Software Engineering at Google"
author = ["Titus Winters", "Tom Manshreck", "Hyrum Wright"]
date = 2026-04-28
tags = ["book", "softwareengineering", "google"]
draft = false
+++

👉 <https://www.goodreads.com/book/show/48816586-software-engineering-at-google>


## Part I: Thesis {#part-i-thesis}


### Ch 1: What Is Software Engineering? {#ch-1-what-is-software-engineering}

-   The core distinction
    -   "**Software engineering is programming integrated over time**" — programming produces code; [software engineering]({{< relref "../../topics/software_engineering.md" >}}) adds
        maintenance, modification, and sustainability over a lifespan
    -   The multiperson, multiversion nature adds team/scale complexity on top
-   Time and Change
    -   Code lifespan varies by ~100,000x (hours to decades) — best practices differ radically at each end
    -   A project is sustainable if it can react to change for its expected lifetime; you don't have to change, but you need
        to be capable of it
    -   Hyrum's Law: with enough users, all observable behaviors of an API will be depended on by somebody — regardless of
        what the contract says
    -   First upgrades (e.g. compiler) are always the most painful; regular upgrades build expertise and make future ones
        cheaper
    -   "It's programming if 'clever' is a compliment, but software engineering if 'clever' is an accusation"
-   Scale and Efficiency
    -   Policies that don't scale: pushing migration work to consumers ("upgrade by Aug 15th") — the Churn Rule inverts
        this: infra teams own migrations
    -   **The Beyoncé Rule**: "If you liked it, you should have put a [CI]({{< relref "../../topics/continuous_integration.md" >}}) test on it" — outages from infra changes not caught by
        [CI]({{< relref "../../topics/continuous_integration.md" >}}) are not the infra team's fault
    -   Expertise is viral; one good expert in a shared forum raises the whole organization
    -   Distributed builds example: solving one scaling problem created a new one (Jevons Paradox — consumption rises with
        efficiency)
-   Trade-offs and Costs
    -   "Cost" = financial + resource + personnel + transaction + opportunity + societal
    -   Decisions should be: "we must" (legal/customer) or "best option given evidence" — never "because I said so"
    -   Data-driven, but not data-only: evidence, precedent, and argument also count
    -   Leaders who admit mistakes are more respected, not less
-   TL;DRs
    -   Software is sustainable when capable of responding to changes in dependencies, technology, or product requirements
    -   Every repeated task should scale linearly or better in human input
    -   Process inefficiencies scale up slowly — beware boiled-frog problems
    -   Expertise + economies of scale pays off particularly well


## Part II: Culture {#part-ii-culture}


### Ch 2: How to Work Well on Teams {#ch-2-how-to-work-well-on-teams}

-   The **Genius Myth**
    -   We romanticize lone geniuses (Linus, Guido, Gates) but success is always a team effort
    -   The cave fantasy (vanish, build in secret, unveil masterpiece) is driven by insecurity
    -   "You are not your code" — self-worth shouldn't be tied to what you build
-   Hiding Considered Harmful
    -   Working alone delays detection of fundamental design mistakes
    -   Bus factor: the number of people who need to be hit by a bus before the project is doomed — raise it by sharing
        knowledge
    -   Feedback loops apply at project level too: many eyes keep the project relevant, not just bug-free
-   The Three Pillars: **Humility, Respect, Trust**

    -   Almost any social conflict traces back to a failure of one of these three
    -   _Lose the ego_ — aim for collective pride, not personal glory
    -   Frame critique as confusion ("I'm confused by this") not accusation ("you're wrong")
    -   "**The more open you are to influence, the more you are able to influence**"
    -   Admitting "I don't know" increases long-term credibility

    > If you chose to assert your ego in any number of ways, "I am going to do it my way," you pay a small steady price
    > throughout the whole of your professional career. And this, over a whole lifetime, adds up to an enormous amount of
    > needless trouble. — Richard Hamming
-   Blameless Post-Mortems (see [DevOps]({{< relref "../../topics/devops.md" >}}))
    -   Root-cause analysis, timeline, impact, action items with owners, lessons learned
    -   Goal: light up the runway for those who follow, not assign blame
-   "Googleyness"

    -   Thrives in ambiguity, values feedback, challenges status quo, puts user first, cares about team, does the right
        thing
    -   "Culture fit" easily becomes unconscious [bias]({{< relref "../../topics/bias.md" >}}) for "is just like me" — watch out

    > An interviewer's personal desire to have a beer with a candidate should never be considered a valid signal about
    > somebody else's performance or ability to thrive at Google.
